Importação

In [1]:
import pandas as pd

Cria um DataFrame com os dados

In [2]:
dados = {
    "Nome": ["Alaire", "Carina", "Karol", "Marcio", "Marti", "Martin"],
    "Idade": [62, 33, 23, 59, 35, 24]
}
df = pd.DataFrame(dados)
df

     Nome  Idade
0  Alaire     62
1  Carina     33
2   Karol     23
3  Marcio     59
4   Marti     35
5  Martin     24

Cria uma Series

In [3]:
s = pd.Series([10, 20, 30])
s

0    10
1    20
2    30
dtype: int64

Lendo tabelas

In [4]:
df = pd.read_csv('dados_pessoas.csv')
df

,ID,CODIGO,DESCRICAO,ENDERECO,NUMERO,BAIRRO,CPF,SALARIO,DEPARTAMENTO
0,766238,765532,JULIANA GRACE GEOVANASE,RUA SAO LUIS,416,SANTANA,40757889034,1200,1
1,766239,765533,MARCELO,AVENIDA DOM JAIME DE BARROS CAMARA,40,PLANALTO,12444179803,3200,2
2,766240,765534,GIOVANI FARINA,RUA LINHA TUNEL,10,FARINA,2579406930,4000,2
3,766241,765535,FILIP STEFANOV FILIPOV,RUA ALVARO GUTERRES,160,TRISTEZA,50853937249,2500,3
4,766242,765536,LISIANE PIMENTEL,"AVENIDA JOAO WALLIG, 1800",325,JARDIM EUROPA,93256230059,2800,3
5,766243,765537,WAGNER FRAGA,RUA RUBEM FONSECA VARGAS,13,DOM FELICIANO,92611915091,2700,3
6,766244,765538,CAIO REIS,AVENIDA TANCREDO NEVES,15,CAMINHO DAS ARVORES,63023148520,2500,3

Ver apenas as 5 primeiras linhas dos dados

In [5]:
df.head()

,ID,CODIGO,DESCRICAO,ENDERECO,NUMERO,BAIRRO,CPF,SALARIO,DEPARTAMENTO
0,766238,765532,JULIANA GRACE GEOVANASE,RUA SAO LUIS,416,SANTANA,40757889034,1200,1
1,766239,765533,MARCELO,AVENIDA DOM JAIME DE BARROS CAMARA,40,PLANALTO,12444179803,3200,2
2,766240,765534,GIOVANI FARINA,RUA LINHA TUNEL,10,FARINA,2579406930,4000,2
3,766241,765535,FILIP STEFANOV FILIPOV,RUA ALVARO GUTERRES,160,TRISTEZA,50853937249,2500,3
4,766242,765536,LISIANE PIMENTEL,"AVENIDA JOAO WALLIG, 1800",325,JARDIM EUROPA,93256230059,2800,3

Ver apenas as 5 últimas linhas dos dados

In [6]:
df.tail()

,ID,CODIGO,DESCRICAO,ENDERECO,NUMERO,BAIRRO,CPF,SALARIO,DEPARTAMENTO
2,766240,765534,GIOVANI FARINA,RUA LINHA TUNEL,10,FARINA,2579406930,4000,2
3,766241,765535,FILIP STEFANOV FILIPOV,RUA ALVARO GUTERRES,160,TRISTEZA,50853937249,2500,3
4,766242,765536,LISIANE PIMENTEL,"AVENIDA JOAO WALLIG, 1800",325,JARDIM EUROPA,93256230059,2800,3
5,766243,765537,WAGNER FRAGA,RUA RUBEM FONSECA VARGAS,13,DOM FELICIANO,92611915091,2700,3
6,766244,765538,CAIO REIS,AVENIDA TANCREDO NEVES,15,CAMINHO DAS ARVORES,63023148520,2500,3

Ver apenas colunas específicas

In [7]:
df[['CODIGO', 'DESCRICAO']]

   CODIGO                DESCRICAO
0  765532  JULIANA GRACE GEOVANASE
1  765533                  MARCELO
2  765534          GIOVANI FARINA
3  765535   FILIP STEFANOV FILIPOV
4  765536        LISIANE PIMENTEL
5  765537            WAGNER FRAGA
6  765538                CAIO REIS

In [8]:
df['DESCRICAO']

0    JULIANA GRACE GEOVANASE
1                    MARCELO
2            GIOVANI FARINA
3     FILIP STEFANOV FILIPOV
4          LISIANE PIMENTEL
5              WAGNER FRAGA
6                  CAIO REIS
Name: DESCRICAO, dtype: object

Filtros

In [9]:
df['NUMERO'] > 50

0     True
1    False
2    False
3     True
4     True
5    False
6    False
Name: NUMERO, dtype: bool

In [10]:
df[df['NUMERO'] > 50]

,ID,CODIGO,DESCRICAO,ENDERECO,NUMERO,BAIRRO,CPF,SALARIO,DEPARTAMENTO
0,766238,765532,JULIANA GRACE GEOVANASE,RUA SAO LUIS,416,SANTANA,40757889034,1200,1
3,766241,765535,FILIP STEFANOV FILIPOV,RUA ALVARO GUTERRES,160,TRISTEZA,50853937249,2500,3
4,766242,765536,LISIANE PIMENTEL,"AVENIDA JOAO WALLIG, 1800",325,JARDIM EUROPA,93256230059,2800,3

Filtros combinados

In [11]:
pessoas_com_numero_maior_50 = df['NUMERO'] > 50
pessoas_bairro_santana = df['BAIRRO'] == 'SANTANA'
df[pessoas_com_numero_maior_50 & pessoas_bairro_santana]

,ID,CODIGO,DESCRICAO,ENDERECO,NUMERO,BAIRRO,CPF,SALARIO,DEPARTAMENTO
0,766238,765532,JULIANA GRACE GEOVANASE,RUA SAO LUIS,416,SANTANA,40757889034,1200,1

Criar uma coluna nova

In [12]:
df['ENDERECO_COMPLETO'] = df['ENDERECO'] + ", " + df['NUMERO'].astype(str) + ", " + df['BAIRRO']
df

,ID,CODIGO,DESCRICAO,ENDERECO,NUMERO,BAIRRO,CPF,SALARIO,DEPARTAMENTO,ENDERECO_COMPLETO
0,766238,765532,JULIANA GRACE GEOVANASE,RUA SAO LUIS,416,SANTANA,40757889034,1200,1,"RUA SAO LUIS, 416, SANTANA"
1,766239,765533,MARCELO,AVENIDA DOM JAIME DE BARROS CAMARA,40,PLANALTO,12444179803,3200,2,"AVENIDA DOM JAIME DE BARROS CAMARA, 40, PLANALTO"
2,766240,765534,GIOVANI FARINA,RUA LINHA TUNEL,10,FARINA,2579406930,4000,2,"RUA LINHA TUNEL, 10, FARINA"
3,766241,765535,FILIP STEFANOV FILIPOV,RUA ALVARO GUTERRES,160,TRISTEZA,50853937249,2500,3,"RUA ALVARO GUTERRES, 160, TRISTEZA"
4,766242,765536,LISIANE PIMENTEL,"AVENIDA JOAO WALLIG, 1800",325,JARDIM EUROPA,93256230059,2800,3,"AVENIDA JOAO WALLIG, 1800, 325, JARDIM EUROPA"
5,766243,765537,WAGNER FRAGA,RUA RUBEM FONSECA VARGAS,13,DOM FELICIANO,92611915091,2700,3,"RUA RUBEM FONSECA VARGAS, 13, DOM FELICIANO"
6,766244,765538,CAIO REIS,AVENIDA TANCREDO NEVES,15,CAMINHO DAS ARVORES,63023148520,2500,3,"AVENIDA TANCREDO NEVES, 15, CAMINHO DAS ARVORES"

Remover coluna criada

In [13]:
df = df.drop('ENDERECO_COMPLETO', axis=1)
df

,ID,CODIGO,DESCRICAO,ENDERECO,NUMERO,BAIRRO,CPF,SALARIO,DEPARTAMENTO
0,766238,765532,JULIANA GRACE GEOVANASE,RUA SAO LUIS,416,SANTANA,40757889034,1200,1
1,766239,765533,MARCELO,AVENIDA DOM JAIME DE BARROS CAMARA,40,PLANALTO,12444179803,3200,2
2,766240,765534,GIOVANI FARINA,RUA LINHA TUNEL,10,FARINA,2579406930,4000,2
3,766241,765535,FILIP STEFANOV FILIPOV,RUA ALVARO GUTERRES,160,TRISTEZA,50853937249,2500,3
4,766242,765536,LISIANE PIMENTEL,"AVENIDA JOAO WALLIG, 1800",325,JARDIM EUROPA,93256230059,2800,3
5,766243,765537,WAGNER FRAGA,RUA RUBEM FONSECA VARGAS,13,DOM FELICIANO,92611915091,2700,3
6,766244,765538,CAIO REIS,AVENIDA TANCREDO NEVES,15,CAMINHO DAS ARVORES,63023148520,2500,3

Resumindo dados

In [14]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 7 entries, 0 to 6
Data columns (total 9 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   ID            7 non-null      int64
 1   CODIGO        7 non-null      int64
 2   DESCRICAO     7 non-null      object
 3   ENDERECO      7 non-null      object
 4   NUMERO        7 non-null      int64
 5   BAIRRO        7 non-null      object
 6   CPF           7 non-null      int64
 7   SALARIO       7 non-null      int64
 8   DEPARTAMENTO  7 non-null      int64
dtypes: int64(6), object(3)
memory usage: 636.0+ bytes

In [15]:
df.describe()

,ID,CODIGO,NUMERO,CPF,SALARIO,DEPARTAMENTO
count,7.000000,7.000000,7.000000,7.000000e+00,7.000000,7.000000
mean,766241.000000,765535.000000,139.857143,5.078953e+10,2700.000000,2.428571
std,2.160247,2.160247,168.054980,3.558420e+10,844.590631,0.786796
min,766238.000000,765532.000000,10.000000,2.579407e+09,1200.000000,1.000000
25%,766239.500000,765533.500000,14.000000,2.660103e+10,2500.000000,2.000000
50%,766241.000000,765535.000000,40.000000,5.085394e+10,2700.000000,3.000000
75%,766242.500000,765536.500000,242.500000,7.781753e+10,3000.000000,3.000000
max,766244.000000,765538.000000,416.000000,9.325623e+10,4000.000000,3.000000

In [16]:
df['SALARIO'].sum()

np.int64(18900)

In [17]:
df['SALARIO'].mean()

np.float64(2700.0)

Contando ocorrências

In [18]:
df['SALARIO'].value_counts()

SALARIO
2500    2
1200    1
3200    1
4000    1
2800    1
2700    1
Name: count, dtype: int64

In [19]:
df['DEPARTAMENTO'].value_counts()

DEPARTAMENTO
3    4
2    2
1    1
Name: count, dtype: int64

Usando Group by

In [20]:
df.groupby('DEPARTAMENTO')['SALARIO'].sum()

DEPARTAMENTO
1     1200
2     7200
3    10500
Name: SALARIO, dtype: int64

In [21]:
df.groupby('DEPARTAMENTO')['SALARIO'].mean()

DEPARTAMENTO
1    1200.0
2    3600.0
3    2625.0
Name: SALARIO, dtype: float64

Ordenação de dados

In [22]:
df.sort_values(by='SALARIO')

,ID,CODIGO,DESCRICAO,ENDERECO,NUMERO,BAIRRO,CPF,SALARIO,DEPARTAMENTO
0,766238,765532,JULIANA GRACE GEOVANASE,RUA SAO LUIS,416,SANTANA,40757889034,1200,1
3,766241,765535,FILIP STEFANOV FILIPOV,RUA ALVARO GUTERRES,160,TRISTEZA,50853937249,2500,3
6,766244,765538,CAIO REIS,AVENIDA TANCREDO NEVES,15,CAMINHO DAS ARVORES,63023148520,2500,3
5,766243,765537,WAGNER FRAGA,RUA RUBEM FONSECA VARGAS,13,DOM FELICIANO,92611915091,2700,3
4,766242,765536,LISIANE PIMENTEL,"AVENIDA JOAO WALLIG, 1800",325,JARDIM EUROPA,93256230059,2800,3
1,766239,765533,MARCELO,AVENIDA DOM JAIME DE BARROS CAMARA,40,PLANALTO,12444179803,3200,2
2,766240,765534,GIOVANI FARINA,RUA LINHA TUNEL,10,FARINA,2579406930,4000,2

In [23]:
df.sort_values(by='SALARIO', ascending=False)

,ID,CODIGO,DESCRICAO,ENDERECO,NUMERO,BAIRRO,CPF,SALARIO,DEPARTAMENTO
2,766240,765534,GIOVANI FARINA,RUA LINHA TUNEL,10,FARINA,2579406930,4000,2
1,766239,765533,MARCELO,AVENIDA DOM JAIME DE BARROS CAMARA,40,PLANALTO,12444179803,3200,2
4,766242,765536,LISIANE PIMENTEL,"AVENIDA JOAO WALLIG, 1800",325,JARDIM EUROPA,93256230059,2800,3
5,766243,765537,WAGNER FRAGA,RUA RUBEM FONSECA VARGAS,13,DOM FELICIANO,92611915091,2700,3
3,766241,765535,FILIP STEFANOV FILIPOV,RUA ALVARO GUTERRES,160,TRISTEZA,50853937249,2500,3
6,766244,765538,CAIO REIS,AVENIDA TANCREDO NEVES,15,CAMINHO DAS ARVORES,63023148520,2500,3
0,766238,765532,JULIANA GRACE GEOVANASE,RUA SAO LUIS,416,SANTANA,40757889034,1200,1